Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Assign a Local constant variable the definition of a structure (read carefully the DllStructCreate remarks).
fr: Assigne une constante locale avec la définition d'une structure (lire attentivement les remarques DllStructCreate).

source: The tag variable is declared as Constant because its value will never change for any script execution.
fr: La variable étiquette est déclarée comme Constant parce que sa valeur ne changera jamais pendant toute l'exécution du script.

source: Assign a Local variable the structure.
fr: Assigne une variable locale avec la structure.

source: If an error occurred display the error code and return False.
fr: Si une erreur s'est produite afficher le code d'erreur et retourner False.

source: Set the data of the element var1 (int) in the $tSTRUCT1.
fr: Définit les données de l'élément var1 (int) dans $tSTRUCT1.

source: Or 1 instead of "var1".
fr: Ou 1 à la place de \"var1\".

source: Set the data of the element var2 (byte) in the $tSTRUCT1.
fr: Définit les données de l'élément var2 (octet) dans $tSTRUCT1.

source: Or "var2" instead of 2.
fr: Ou \"var2\" au lieu de 2.

source: Set the data of the element var3 (uint) in the $tSTRUCT1.
fr: Définit les données de l'élément var3 (uint) dans $tSTRUCT1.

source: The -1 (signed int) will be typecasted to unsigned int.
fr: Le -1 (Int signé) sera converti en un int non signé.

source: Or 3 instead of "var3".
fr: Ou 3 au lieu de \"var3\".

source: Set the data of the element var4 (char) in the $tSTRUCT1.
fr: Définit les données de l'élément var4 (char) dans la $tSTRUCT1.

source: Or 4 instead of "var4".
fr: Ou 4 au lieu de \"var4\".

source: This element can contain up to 128 characters.
fr: Cet élément peut contenir jusqu'à 128 caractères.

source: Change the data of the element var4 (char) in the $tSTRUCT1, at the index 1 of the char array (1 based index).
fr: Modifie les données de l'élément var4 (char) dans $tSTRUCT1, à l'indice 1 du tableau de caractères (de base 1).

source: Or "var1" instead of 1.
fr: Ou \"var1\" au lieu de 1.

source: Or 2 instead of "var2".
fr: Ou 2 à la place de \"var2\".

source: Or "var3" instead of 3.
fr: Ou \"var3\" au lieu de 3.

source: Or "var4" instead of 4.
fr: Ou \"var4\" au lieu de 4.

source: Release the resources used by the structure.
fr: Libérer les ressources utilisées par la structure.

source: Returns the data of an element of the struct.
fr: Retourne les données d'un élément de la structure.

source: The struct returned by DllStructCreate().
fr: La structure renvoyée par DllStructCreate().

source: Which element of the struct you want to access, starting at 1 or the element name as defined in DllStructCreate().
fr: L'élément de la structure auquel vous souhaitez accéder, à partir de 1 ou du nom de l'élément tel que défini dans DllStructCreate().

source: For elements that are an array this specifies the 1-based index to retrieve.
fr: Pour les éléments qui sont dans un tableau spécifie par l'index de base 1 à récupérer.

source: If omitted or the Default keyword then the entire array is retrieved (Useful for quickly retrieving strings).
fr: S'il est omis ou si Default keyword, l'ensemble du tableau est récupéré (utile pour récupérer rapidement les chaînes).

source: Not used for non-array elements.
fr: Ne pas utiliser pour les éléments non-array.

source: char[n], wchar[n] and byte[n] return all element data when index is omitted.
fr: char[n], wchar[n] et byte[n] retourne toutes les données de l'élément lorsque l'indice est omis.

source: Data in the element of the struct.
fr: Retourne les données dans l'élément de la structure.

source: 1 = Struct not a valid struct returned by DllStructCreate().
fr: 1 = La structure n'est pas une structure correcte retournée par DllStructCreate().

source: 2 = Element out of range or unknown.
fr: 2 = Valeur de l'élément en dehors des limites ou inconnu.

source: 3 = Index out of range.
fr: 3 = L'index est hors des limites.

source: 4 = Element data type is unknown
fr: 4 = Type d'élément de donnée inconnu

source: When the element is char or char[n], wchar or wchar[n] the data returned is always a String(),
fr: Lorsque l'élément est char ou char[n], wchar ou wchar[n] la donnée renvoyée est toujours une String(),

source: when the element is byte[n] and index is omitted the data returned is a binary type,
fr: lorsque l'élément est byte[n] et l'index est omis la donnée renvoyée est de type binaire,

source: otherwise it always returns the best fit AutoIt datatype corresponding to the type of the individual element (e.g. byte returns Int32, float returns Double).
fr: sinon, elle retourne toujours le meilleur type de donnée correspondant au type de l'élément individuel (c'est-à-dire 'byte' retourne 'Int32', 'float' retourne 'Double').

source: Returns the pointer to the struct or an element in the struct.
fr: Retourne le pointeur vers la structure ou un élément dans la structure.

source: The element of the struct whose pointer you need, starting at 1 or the element name as defined in DllStructCreate().
fr: L'élément de la structure qui est le pointeur dont vous avez besoin, à partir de 1 ou du nom de l’élément tel que défini dans DllStructCreate().

source: The pointer to the struct.
fr: Retourne le pointeur vers la structure.

source: 2 = Element out of range.
fr: 2 = La valeur de l’élément est hors limites.

source: Used in DllCall().
fr: Utilisé dans DllCall().

source: Assign a Local variable the handle of the current active window.
fr: Assigne une variable locale avec le handle de la fenêtre active.

source: Same as:
fr: Même que :

source: "[active]".
fr: « [ actif ] ».

source: Assign a Local variable the window's rectangle (array).
fr: Assigne une variable locale avec le rectangle de la fenêtre (tableau).

source: Assign a Local variable the structure created with the tagRECT definition.
fr: Assigne une variable locale avec la structure créée avec la définition de tagRECT.

source: Make the DllCall of the GetWindowRect function.
fr: Fait le DllCall de la fonction GetWindowRect.

source: Note:The 2nd parameter of the GetWindowRect function requires a pointer,
fr: Remarque: le deuxième paramètre de la fonction GetWindowRect nécessite un pointeur,

source: the result returned by the DllStructCreate is NOT a pointer, the function DllStructGetPtr must be used.
fr: le résultat renvoyé par DllStructCreate n'est pas un pointeur, la fonction DllStructGetPtr doit être utilisé.

source: Assign Local variables the returned rectangle.
fr: Affecte des variables locales avec le rectangle retourné.

source: Or 1 instead of "Left".
fr: Ou 1 à la place de «gauche».

source: Or "Top" instead of 2.
fr: Ou \"Top\" au lieu de 2.

source: Or "Right" instead of 3.
fr: Ou \" droit \" au lieu de 3.

source: Or 4 instead of "Bottom".
fr: Ou 4 au lieu de \"Bas\".

source: Display the results of WinGetPos and the returned rectangle.
fr: Affiche les résultats de WinGetPos et le rectangle retourné.

source: Assign a Local variable a structure with the definition of an int.
fr: Assigne une variable locale d'une structure à la définition d'un int.

source: Assign a Local variable the tSTRUCT1 structure except that the elements will be got according to the new definition.
fr: Assigne une variable locale de la structure tSTRUCT1 sauf que les éléments seront obtenu selon la nouvelle définition.

source: Notes:-The structures points to the same structure (they have the same pointer);
fr: Notes: structures -Les des points à la même structure (ils ont le même pointeur);

source: The first element got with the:
fr: Le premier élément a avec le :

source: *tSTRUCT1 struct will be an int.
fr: * tSTRUCT1 structure sera un int.

source: *tSTRUCT2 struct will be an unsigned int (the element is casted from int to uint).
fr: * tSTRUCT2 structure sera un unsigned int (l'élément est coulé de int en uint).

source: *tSTRUCT3 struct will be a float (the element is casted from int to float).
fr: * tSTRUCT3 structure sera un flotteur (l'élément est coulé de int à flotter).

source: -The "reinterpret_cast" casting operator is used.
fr: -Le Opérateur de casting \" de reinterpret_cast \" est utilisé.

source: Set the data of the first element (int) in the $tSTRUCT1.
fr: Définir les données du premier élément (int) dans le tSTRUCT1 $.

source: Display the different data types of the same data.
fr: Affiche les différents types de données des mêmes données.

source: Release the resources used by the structures.
fr: Libérer les ressources utilisées par les structures.

source: Returns the size of the struct in bytes.
fr: Retourne la taille de la structure en octets.

source: the size of the struct in bytes.
fr: Retourne la taille de la structure en octets.

source: 1 = Struct not a correct struct returned by DllStructCreate().
fr: 1 = La structure n'est pas une structure correcte retourné par DllStructCreate().

source: Used when data in the struct needs to hold the struct size.
fr: Utilisé lorsque les données dans la structure ont besoins d'obtenir la taille d'une structure.

source: Assign a Local constant variable the definition of a structure.
fr: Assigne une constante locale avec la définition d'une structure.

source: Returns an array containing the enumerated drives.
fr: Retourne un tableau contenant les lecteurs énumérés.

source: Type of drive to find:
fr: Type de lecteurs à chercher :

source: "ALL", "CDROM", "REMOVABLE", "FIXED", "NETWORK", "RAMDISK", or "UNKNOWN"
fr: "ALL", "CDROM", "REMOVABLE", "FIXED", "NETWORK", "RAMDISK", ou "UNKNOWN"

source: an array of strings (drive letter followed by colon) of drives found.
fr: Retourne un tableau de chaînes (lettre du lecteur suivie de :) des lecteurs trouvés.

source: The zeroth array element contains the number of drives.
fr: L'élément 0 du tableau contient le nombre de lecteurs.

source: An error occurred when retrieving the drives.
fr: Une erreur s'est produite lors de la récupération des disques.

source: Show all the drives found and convert the drive letter to uppercase.
fr: Affiche tous les lecteurs trouvés et convertit la lettre de lecteur en majuscules.

source: Returns File System Type of a drive.
fr: Retourne le type de système de fichiers d'un lecteur.

source: Path of drive to receive information from.
fr: Chemin du lecteur dont on veut recevoir les informations.

source: the File System Type of the drive as a string; see table below.
fr: Retourne le type de système de fichiers du lecteur sous la forme d'une chaîne; voir le tableau ci-dessous.

source: Interpretation
fr: Interprétation

source: Drive does NOT contain media (CD, Floppy, Zip) or media is unformatted (RAW).
fr: Le lecteur ne contient pas de média (CD, Disquette, Zip) ou le média n'est pas formaté (RAW).

source: Typical file system for drives under ~500 MB such as Floppy, RAM disks, USB "pen" drives, etc.
fr: Système de fichier typique des disques inférieurs à ~ 500 Mo tels que les disquettes, disques RAM, lecteurs USB "pen", etc

source: Typical file system for Windows 9x/Me hard drives.
fr: Système de fichier typique des diques durs Windows 9x/Me

source: Typical file system for Windows hard drives.
fr: Système de fichier typique des diques durs Windows NT/2000/XP

source: Typical file system for Novell Netware file servers.
fr: Système de fichier typique des serveurs de fichiers Novell.

source: Typically indicates a CD (or an ISO image mounted as a virtual CD drive).
fr: Indique généralement un CD (ou une image ISO montée comme un lecteur de CD virtuel).

source: Typically indicates a DVD.
fr: Indique généralement un DVD.

source: The list of possible return values might be incomplete.
fr: La liste des valeurs de retour possibles est peut-être incomplète.

source: Find the file system type of the home drive, generally this is the C:\ drive.
fr: Trouver le type de lecteur de base du système de fichiers, en général c'est le lecteur C:\\.

source: Returns Volume Label of a drive, if it has one.
fr: Retourne le nom de volume d'un lecteur s'il en a un.

source: the Volume Label of the drive as a string.
fr: Retourne le nom de volume du lecteur sous forme d'une chaîne.

source: Find the volume label of the home drive, generally this is the C:\ drive.
fr: Trouvez le nom de volume du lecteur de la maison, en général c'est le lecteur C:\\.

source: Returns Serial Number of a drive.
fr: Retourne le numéro de série d'un lecteur.

source: the Serial Number of the drive as a string.
fr: Retourne le numéro de série du lecteur sous forme d'une chaîne.

source: The value returned is not the hardware serial number as found on the label of the drive, it is the Windows Volume ID for the drive.
fr: Aucune.

source: Find the serial number of the home drive, generally this is the C:\ drive.
fr: Trouver le numéro de série de l'entraînement à la maison, en général c'est le lecteur C:\\.

source: Returns drive type.
fr: Retourne le type de lecteur.

source: [optional]The drive type operation to perform.
fr: [optional] Le type d'information du lecteur à retourner.

source: $DT_DRIVETYPE (1) = the type of drive (default)
fr: $DT_DRIVETYPE (1) = le type de lecteur (défaut)

source: $DT_SSDSTATUS (2) = SSD status of the drive
fr: $DT_SSDSTATUS (2) = statut SSD du lecteur

source: $DT_BUSTYPE (3) = the bus type of drive
fr: $DT_BUSTYPE (3) = le type de bus du lecteur

source: Constants are defined in Constants.au3
fr: Les constantes sont définies dans Constants.au3

source: Sets the @error flag to 1 if a bad path was given, or if the operation failed.Return value is "".
fr: Retourne "" et @error = 1.

source: If the mode parameter is $DT_DRIVETYPE (1), returns the type of drive.
fr: Si le paramètre du mode est $DT_DRIVETYPE (1), la fonction retourne le type de lecteur.

source: The path must be a string volume name, such as "C:\".
fr: Le chemin doit être une string qui contient le nom du volume, comme "C:\".

source: Return values are:
fr: Les valeurs retournées sont:

source: If the mode parameter is $DT_SSDSTATUS (2), returns the SSD status of the drive.
fr: Si le paramètre du mode est $DT_SSDSTATUS (2), la fonction retourne le statut SSD du lecteur.

source: The path can be a string volume name, or an integer drive index.
fr: Le chemin peut être une chaîne qui contient le nom du volume, ou un entier, index du lecteur.

source: If the mode parameter is $DT_BUSTYPE (3), returns the bus type of the drive.
fr: Si le paramètre du mode est $DT_BUSTYPE (3), la fonction retourne le type de bus du lecteur.

source: Check the drive type for C:\
fr: Vérifiez le type de lecteur C :\\

source: Check the SSD status for C:\
fr: Vérifiez l'état SSD C :\\

source: Check the SSD status for disk 0
fr: Vérifie l'état de SSD pour le disque 0

source: Check the bus type status for disk 0
fr: Vérifie l'état du type de bus pour le disque 0

source: Maps a network drive.
fr: Mappe un lecteur réseau.

source: The device to map, for example "O:" or "LPT1:".
fr: Périphérique à mapper, par exemple "O:" ou "LPT1:".

source: If you pass an empty string for this parameter a connection is made but not mapped to a specific drive.
fr: Si vous passez une chaîne vide pour ce paramètre une connexion est établie mais pas mappée à un lecteur spécifique.

source: If you specify "*" an unused drive letter will be automatically selected.
fr: Si vous spécifiez "*" une lettre de lecteur non utilisée sera automatiquement sélectionnée.

source: The remote share to connect to in the form "\\server\share".
fr: Le partage distant à connecter sous la forme "\\server\share".

source: A combination of the following:
fr: Une combinaison des éléments suivant :

source: 0 = default
fr: 0 = Défaut

source: 1 = Persistent mapping
fr: 1 = Connexion persistante

source: 8 = Show authentication dialog if required
fr: 8 = Montre la demande d'authentification si nécessaire

source: The username to use to connect.
fr: Le nom de l'utilisateur à utiliser pour la connexion.

source: In the form "username" or "domain\username".
fr: Sous la forme "username" ou "domain\username".

source: The password to use to connect.
fr: Le mot de passe à utiliser pour la connexion.

source: (See Remarks)
fr: (Consultez les remarques)

source: 0 if a new mapping could not be created and sets the @error flag to non-zero.
fr: Retourne 0 si une nouvelle connexion ne peut pas être créée et assigne @error.(Consultez les remarques).

source: 1 = Undefined / Other error.
fr: 1 = Erreur Indéfinie/Autre.

source: @extended set with Windows API return
fr: @extended est défini avec le code de retour de l'API Windows

source: 2 = Access to the remote share was denied
fr: 2 = L'accès au partage distant a été refusé

source: 3 = The device is already assigned
fr: 3 = Le périphérique est déjà assigné

source: 4 = Invalid device name
fr: 4 = Nom de périphérique invalide

source: 5 = Invalid remote share
fr: 5 = Partage distant invalide

source: 6 = Invalid password
fr: 6 = Mot de passe invalide

source: When using "*" for the device parameter the drive letter selected will be returned instead of 1 or 0, e.g."U:".
fr: En utilisant "*" comme paramètre de périphérique, la lettre de lecteur sélectionnée sera retournée au lieu de 1 ou 0, par exemple "U:".

source: If there was an error using "*" then an empty string "" will be returned.
fr: S'il y avait une erreur en utilisant "*" alors une chaîne vide "" serait retournée.

source: If defined the user/password will be presented to the remote computer that will validate the credential.
fr: Si user/password sont définis, ils seront présentés à l'ordinateur distant qui validera le certificat.

source: Map X drive to \\myserver\stuff using current user
fr: Mappe le lecteur X sur \\monserveur\stuff en utilisant l'utilisateur courant

source: Map X drive to \\myserver2\stuff2 using the user "jon" from "domainx" with password "tickle"
fr: Mappe le lecteur X sur \\myserver2\stuff2 en utilisant l'utilisateur \"jon\" du \"domainx\" avec le mot de passe \"tickle\"

source: Disconnects a network drive.
fr: Déconnecte un lecteur réseau.

source: The device to disconnect, e.g."O:" or "LPT1:".
fr: Le périphérique à déconnecter, par exemple "O:" ou "LPT1:".

source: 0 if the disconnection was unsuccessful.
fr: Retourne 0 si la déconnexion à échouée.

source: If a connection has no drive letter mapped you may use the connection name to disconnect, e.g.\\server\share
fr: Si une connexion n'a pas de lettre de mappage, vous devez utiliser le nom de la connexion pour déconnecter, par exemple \\server\share

source: Disconnect
fr: Déconnecte

source: Retrieves the details of a mapped drive.
fr: Récupère les informations d'un disque mappé.

source: The device (drive or printer) letter to query, e.g."O:" or "LPT1:"
fr: La lettre du périphérique (lecteur ou imprimante) à interroger, par exemple "O:" ou "LPT1:"

source: a details of the mapping, e.g.\\server\share
fr: Retourne les détails du mappage, par exemple \\server\share

source: an empty string "" and sets the @error flag to 1.
fr: Retourne une chaîne vide "" et @error = 1.

source: Get details of the mapping
fr: Obtient des renseignements sur le mappage

source: Sets the Volume Label of a drive.
fr: Définit le nom de volume d'un lecteur.

source: Path of drive to change.
fr: Chemin du lecteur à modifier.

source: New volume label for the drive.
fr: Nouveau nom de volume du lecteur.

source: (11 characters is usually max length)
fr: (la longueur max habituelle est de 11 caractères)

source: Most hard drives have a maximum label length of 11 characters, and DriveSetLabel() will fail if max length is exceeded.
fr: La plupart des disques durs ont une longueur de nom maximale de 11 caractères et DriveSetLabel() échouera si la longueur maximale est dépassée.

source: Also, FAT32 partition labels tend to revert to all capital letters.
fr: De plus, les noms des partitions FAT32 ont tendance à revenir en lettres majuscules.

source: Change the label of the home drive, generally this is the C:\ drive.
fr: Changer le nom du volume du lecteur principal, en général c'est le lecteur C:\

source: Returns the free disk space of a path in Megabytes.
fr: Retourne l'espace disque libre d'un lecteur en Méga-octet.

source: the free disk space in Megabytes as a float number.
fr: Retourne l'espace libre du lecteur en Méga-octets comme nombre flottant.

source: 0 and sets the @error flag to 1.
fr: Retourne 0 et @error = 1.

source: DriveSpaceFree() may even work when a complete directory path (that exists) is given.
fr: DriveSpaceFree() peut fonctionner même si le chemin donné est celui d'un répertoire existant sur le lecteur.

source: However, a file path won't work.
fr: Un chemin vers un fichier ne fonctionnera pas.

source: Use the Round() function if the return value is too precise.
fr: Utilisez la fonction Round() pour obtenir une valeur arrondie.

source: Find the free disk space of the home drive, generally this is the C:\ drive.
fr: Trouve l'espace libre sur le disque du lecteur principal, en général c'est le lecteur C:\

source: Returns the total disk space of a path in Megabytes.
fr: Retourne l'espace disque total d'un lecteur en Méga-octet.

source: the diskspace in Megabytes as a float number.
fr: Retourne l'espace total du lecteur en Méga-octets comme nombre flottant.

source: DriveSpaceTotal() may even work when a complete directory path (that exists) is given.
fr: DriveSpaceTotal() peut fonctionner même si le chemin donné est celui d'un répertoire existant sur le lecteur.

source: Find the total disk space of the home drive, generally this is the C:\ drive.
fr: Trouve l'espace disque total du lecteur principal, en général c'est le lecteur C:\

source: Returns the status of the drive as a string.
fr: Retourne le status d'un disque sous forme de chaîne.

source: Drive may be unformatted (RAW).
fr: Disque probablement pas formaté (RAW).

source: Typical of hard drives and drives that contain removable media.
fr: Typique des disques dur et lecteurs contenant un média amovible.

source: Typical of floppy and CD drives that do not contain media.
fr: Typique des lecteurs de disquettes et des lecteurs CD/DVD qui ne contiennent pas de média.

source: May indicate the drive letter does not exist or that a mapped network drive is inaccessible.
fr: Peut indiquer une lettre de lecteur inexistante ou un lecteur réseau inaccessible.

source: The list of possible return values may be incomplete.
fr: La liste des valeurs de retour peut être incomplète.

source: DriveStatus() may even work when a complete directory path (which exists) is given.
fr: DriveStatus() peut fonctionner même si le chemin donné est celui d'un répertoire existant sur le lecteur.

source: Find the status of the home drive, generally this is the C:\ drive.
fr: Trouve le statut de l'unité principale, c'est généralement le lecteur C:\.

source: Retrieves an environment variable.
fr: Récupère une variable d'environnement.

source: Name of the environment variable to get such as "TEMP" or "PATH".
fr: Nom de la variable d'environnement à récupérer comme "TEMP" ou "PATH"

source: Returns the requested variable (or an empty string if the variable does not exist).
fr: Retourne la variable demandée (ou une chaîne vide si la variable n'existe pas).

source: Retrieve the value of the environment variable %APPDATA%.
fr: Récupére la valeur de la variable d'environnement %APPDATA%.

source: When you assign or retrieve an envorinment variable you do so minus the percentage signs (%).
fr: Lorsque vous affectez ou récupérez une variable d'environnement vous le faites moins les signes de pourcentage (%).

source: Display the value of the environment variable %APPDATA%.
fr: Affiche la valeur de la variable d'environnement %APPDATA%.

source: This returns the same value as the macro @AppDataDir does.
fr: Ceci renvoie la même valeur que la macro AppDataDir.
